// Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает вторую цифру этого числа.

int b = 0;
int LastNumber (int a) { 
    return b = (a / 10)% 10;
}
Console.WriteLine (LastNumber (186));